{
    "close-button": "Close",

    "aboutTab": "About",
    "careerTab": "Career",
    "projectsTab": "Projects",
    "skillsTab": "Skills",
    "resumeTab": "My Resume",

    "languagesTitle" : "Languages",
    "softSkillsTitle" : "Soft Skills",
    "hardSkillsTitle" : "Hard Skills",
    "profileTitle": "Computer engineering student",

    "about-citation": "Passionate developer, I combine technical skills, analysis, and understanding of business challenges to design innovative solutions.",
    "about-presentation-1": "I am Emile Boulanger, a computer science student at CESI Engineering School in Bordeaux (currently in my fifth year of studies).",
    "about-presentation-2": "Passionate about software engineering, both backend and frontend, I am particularly drawn to the creative and analytical aspects this field offers.",
    "about-presentation-3": "I aim to contribute to projects where my work will have a visible and meaningful impact, ideally making a positive contribution to society.",
    "about-presentation-4": "My goal is to grow in the technical field of software development while staying connected to business challenges, taking on a thoughtful and strategic design role befitting an engineer.",
    "about-presentation-5": "You will gain deeper insights into my personality and background through this page.",

    "about-internship-search": "I am looking for a 6-month final-year internship starting on February 6, 2026, combining software engineering and project management.",

    "career-label-now" : "Now",
    "career-cesi" : "CESI Engineering school Bordeaux",
    "career-cesi-diplome" : "Computer Engineering Diploma",
    "career-cesi-text": "CESI is based on the Problem Based Learning (PBL) method, which places group projects in complete autonomy at the center of learning. I am currently in my 5th year of specialization in computer science.",   
    
    "career-ets": "École de Technologie Supérieure (ETS) | Montreal, Canada",
    "career-ets-diplome": "Academic semester in Software Engineering in Quebec",
    "career-ets-text": "I spent 4 months at ETS studying in a Bachelor's program in Software Engineering. There, I deepened my skills in software analysis and design, software architectures, effective user interface design, and advanced algorithms.",
    
    "career-bac": "Val-de-Garonne High School, Marmande",
    "career-bac-diplome": "Scientific Baccalaureate Diploma",
    "career-bac-text": "Diploma obtained with the Highest Honors. My specialties were: Mathematics, Computer Science, and Engineering Science.",
    "career-academic-career": "Academic Career",
    "career-professional-career": "Professional Experience",

    "career-careline": "09/2024 - 12/2024 | Careline Solutions, Mérignac",
    "career-careline-exp": "Fullstack Developer Internship: .NET / C# / React.js",
    "career-careline-text1": "Careline Solutions is a startup offering a multi-parameter telemonitoring platform for patients with heart failure.",
    "career-careline-text2": "I joined as a Fullstack Developer Intern, working according to the Agile Scrum methodology with a V-model development cycle. I contributed to the development of new features, and my main mission was to migrate a significant module of the software to make it independent from the rest.",
    "career-careline-text3": "Thus, carrying out this project independently led me to follow these steps:",
    "career-careline-text4": "- Requirements gathering",
    "career-careline-text5": "- Formalizing requirements by drafting a comprehensive specification document (accompanied by FIGMA mockups)",
    "career-careline-text6": "- Technical breakdown into Epics, Features, User Stories, and Tasks in Azure",
    "career-careline-text7": "- Sprint-based feature planning",
    "career-careline-text8": "- Creating a new Web API (.NET) & a Frontend project (React) 'From Scratch'",
    "career-careline-text9": "- Setting up secure authentication via Entra ID (formerly Azure AD)",
    "career-careline-text10": "- Developing features",
    
    "career-watsoft": "01/2024 - 04/2024 | Watsoft Distribution, Pessac",
    "career-watsoft-exp": "Fullstack Developer Internship: .NET / C# / Vue.js",
    "career-watsoft-text1": "As a fullstack developer intern at Watsoft, I was involved in all aspects of software development. Working within a small team, I participated in maintenance tasks (TMA) in an Agile environment. My main mission (3 months) involved the complete overhaul of a critical ERP feature. Thus, independently, I designed the new solution through all these steps:",
    "career-watsoft-text2": "1 - Requirement analysis",
    "career-watsoft-text3": "2 - Planning",
    "career-watsoft-text4": "3 - Creation of the new solution's design (Figma mockups)",
    "career-watsoft-text5": "4 - UML modeling (class/sequence diagrams)",
    "career-watsoft-text6": "5 - Frontend Development (Vue.js with Quasar framework)",
    "career-watsoft-text7": "6 - Backend Development (.NET C#, using hexagonal architecture)",
    
    "career-cgi": "04/2023 - 07/2023 | CGI, Le Haillan",
    "career-cgi-exp": "Digital Designer Internship",
    "career-cgi-text": "As part of a development team following the Agile Scrum methodology, I contributed to the creation of two internal mobile applications using React Native. I participated in designing the application mockups (UI design), brainstorming on business logic, and frontend development under the guidance of a Tech Lead.",
    
    "career-rauzan": "08/2022 | Caves de Rauzan, Rauzan",
    "career-rauzan-exp": "Cellar Employee",
    "career-rauzan-text": "I performed cleaning and maintenance tasks, various other cellar work, and participated in the Crémant harvest.",
    
    "career-girondehabitat": "01/2018 | Gironde Habitat, Bordeaux",
    "career-girondehabitat-exp": "Observation Internship in the Legal Department",
    "career-girondehabitat-text": "3rd-year observation internship. Introduction to the professional and legal environment.",

    "project-type-personnal" : "Personnal project",
    "project-type-academic" : "Academic project",
    "project-type-associative" : "Associative project",
    "project-button-learnmore" : "Learn More", 
    
    "project-description-geogames": "My largest project to date, a full website of geographical and cultural games.",
    "project-description-cozyhomes": "Frontend part of a housing rental website in React.js.",
    "project-description-easysave": ".NET C# backup software with a WPF interface.",
    "project-description-portfolio": "This website! Developed in React.js.",
    "project-description-dbmanager" : "SQL Server database management software.",
    "project-description-internship-website" : "Internship search website designed for CESI students.",
    "project-description-adminsi" : "Redesign of the Abstergo company information system..",
    "project-description-conceptionbdd" : "Designing the MySQL database for a travel agency.",
    "project-description-cesinova" : "Creation of a mini-rocket for the ArianeGroup competition.",
    "project-description-funkytown" : "Designing the network architecture of a fictional company.",
    "project-description-www" : "Creation of a miniature weather station on an Arduino board.",
    "project-description-github" : "My GitHub repository contains other small projects.",

    "project-title-geogames" : "GeoGames",
    "project-title-cozyhomes" : "CozyHomes",
    "project-title-easysave" : "EasySave",
    "project-title-portfolio" : "Portfolio Website",
    "project-title-dbmanager" : ".NET Database Manager",
    "project-title-internship-website" : "CESI-STAGES.FR",
    "project-title-adminsi" : "IT administration",
    "project-title-conceptionbdd" : "Database Design",
    "project-title-cesinova" : "CESINOVA V1 rocketship",
    "project-title-funkytown" : "Funkytown Project",
    "project-title-www" : "Worldwide Weather Watcher Project",
    "project-title-github" : "Other GitHub Projects",

    "project-detail-geogames1": "GeoGames is a fun quiz platform about geography, which I designed to share and democratize one of my passions: discovering the world.",
    "project-detail-geogames2": "The project offers different types of quizzes, ranging from classic questions to timed challenges, as well as more open formats like listing all the countries of a continent. Players can test their knowledge, improve their score, and compare themselves thanks to a ranking system.",
    "project-detail-geogames3": "Beyond the fun aspect, the goal is to make learning geography more interactive and motivating by adding a competitive and social dimension.",
    "project-detail-geogames4": "On the technical side, I designed and developed the entire architecture: a React frontend for the user interface, a Node.js backend with Express for API management, and a MongoDB database to store quizzes, answers, and scores.",
    "project-detail-geogames5": "The project also includes secure authentication, a well-thought-out data model to manage relationships between users, quizzes, and results, as well as a modular organization system that makes it easy to add new types of quizzes.",
    "project-detail-geogames6": "GeoGames allowed me to manage a complete project, combining technical design, backend architecture, frontend development, and product thinking.",
    "project-detail-cozyhomes1": "CozyHomes is a starting point for a lodging rental website, hotel, house, or other accommodation type.",
    "project-detail-cozyhomes2": "I only worked on the frontend part, which I developed using the React framework.",
    
    "project-description-easysave1": "EasySave is a backup software developed in C# .NET, featuring a WPF graphical interface and MVVM architecture.",
    "project-description-easysave2": "The software allows launching full or differential backups in parallel or sequentially.",
    "project-description-portfolio1": "The website you are currently browsing!",
    "project-description-portfolio2": "Developed in React, using the MaterialUI UI component library.",
    "project-description-dbmanager1": "This software allows managing the database of a sales company. Various actions such as creation, modification, or deletion can be performed.",
    "project-description-dbmanager2": "It is developed in C++ .NET with a WinForms graphical interface and an MVC architecture.",
    "project-description-internship-website1": "This website is a platform designed to assist students in their internship search by gathering job offers and enabling direct applications from cesi-stages.",
    "project-description-internship-website2": "It is developed in HTML/CSS/JS/PHP using the Laravel framework.",
    "project-description-adminsi1": "This project involves the redesign of the information system of the fictional company Abstergo, from firewall configuration to Active Directory setup, including the design of backup or authentication policies.",
    "project-description-adminsi2": "We designed a LAN - DMZ - WAN architecture and simulated this internal network using VirtualBox virtual machines.",
    "project-description-conceptionbdd1": "This small project, serving as an introduction to databases, involved designing the database for a travel agency.",
    "project-description-conceptionbdd2": "We developed the Entity-Relationship Diagram (ERD) and other schemas for the relational database, then implemented it on MySQL.",
    "project-description-funkytown1": "Funkytown is a fictional city for which we were tasked through this project. Our team designed the network architecture for the buildings outlined in red.",
    "project-description-funkytown2": "To simulate all the networks in the city, we created a PacketTracer model in which we configured each equipment using various protocols and our IP addressing plan.",
    "project-description-www1" : "Worldwide Weather Watcher is a weather station installed on an Arduino Uno board. It allows you to take different readings, such as temperature or atmospheric pressure, using sensors.",

    "skill-interpersonal" : "Interpersonal skills",
    "skill-teamwork" : "Teamwork",
    "skill-flexibility" : "Flexibility",
    "skill-positivity" : "Positivity",
    "skill-teaching" : "Teaching ability",
    "skill-db" : "Databases",
    "skill-french" : "French",
    "skill-english" : "English",
    "skill-deutsch" : "Deutsch",
    "skill-french-level" : "Native French",
    "skill-english-level" : "Level C1 - TOEIC 950/990",
    "skill-deutsch-level" : "Level A2",
    "skill-software-architecture": "Software Architectures",
    "skill-hexagonal-architecture": "Hexagonal Architecture"
}