{
    "aboutTab": "About",
    "careerTab": "Career",
    "projectsTab": "Projects",
    "skillsTab": "Skills",
    "resumeTab": "My Resume",

    "profileTitle": "Computer engineering student",

    "about-citation": "Passionate developer, I combine analysis and technical skills to create innovative solutions.",
    "about-presentation-1": "I am Emile Boulanger, a computer science student at CESI Engineering school in Bordeaux (currently in BAC+3).",
    "about-presentation-2": "Passionate about the world of software and web development, both on the backend and frontend, I am particularly drawn to the creative and analytical aspects that this field brings.",
    "about-presentation-3": "My aspiration is to contribute to dynamic and stimulating projects that foster innovation.",
    "about-presentation-4": "I plan to evolve in the technical aspects of development before eventually moving towards responsibilities related to project management.",
    "about-presentation-5": "You will have a deeper insight into my personality and my journey through this page.",

    "career-label-now" : "Now",
    "career-cesi" : "CESI Engineering school Bordeaux",
    "career-cesi-diplome" : "Computer Engineering Diploma",

    "career-cesi-text": "CESI is based on the Problem Based Learning (PBL) method, which places group projects in complete autonomy at the center of learning. I am currently in my 3rd year of specialization in computer science.",   
    "career-bac": "Val-de-Garonne High School, Marmande",
    "career-bac-diplome": "Scientific Baccalaureate Diploma",
    "career-bac-text": "Diploma obtained with the Highest Honors. My specialties were: Mathematics, Computer Science, and Engineering Science.",
    "career-academic-career": "Academic Career",
    "career-professional-career": "Professional Experience",

    "career-watsoft": "01/2024 - 04/2024 | Watsoft Distribution, Pessac",
    "career-watsoft-exp": "Fullstack Developer Internship: .NET / C# / Vue.js",
    "career-watsoft-text1": "As a fullstack developer intern at Watsoft, I was involved in all aspects of software development. Working within a small team, I participated in maintenance tasks (TMA) in an Agile environment. My main mission (3 months) involved the complete overhaul of a critical ERP feature. Thus, independently, I designed the new solution through all these steps:",
    "career-watsoft-text2": "1 - Requirement analysis",
    "career-watsoft-text3": "2 - Planning",
    "career-watsoft-text4": "3 - Creation of the new solution's design (Figma mockups)",
    "career-watsoft-text5": "4 - UML modeling (class/sequence diagrams)",
    "career-watsoft-text6": "5 - Frontend Development (Vue.js with Quasar framework)",
    "career-watsoft-text7": "6 - Backend Development (.NET C#, using hexagonal architecture)",
    "career-cgi": "04/2023 - 07/2023 | CGI, Le Haillan",
    "career-cgi-exp": "Digital Designer Internship",
    "career-cgi-text": "As part of a development team following the Agile Scrum methodology, I contributed to the creation of two internal mobile applications using React Native. I participated in designing the application mockups (UI design), brainstorming on business logic, and frontend development under the guidance of a Tech Lead.",
    "career-rauzan": "08/2022 | Caves de Rauzan, Rauzan",
    "career-rauzan-exp": "Cellar Employee",
    "career-rauzan-text": "I performed cleaning and maintenance tasks, various other cellar work, and participated in the Crémant harvest.",
    "career-girondehabitat": "01/2018 | Gironde Habitat, Bordeaux",
    "career-girondehabitat-exp": "Observation Internship in the Legal Department",
    "career-girondehabitat-text": "3rd-year observation internship. Introduction to the professional and legal environment."
}