{
    "close-button": "Close",

    "aboutTab": "About",
    "careerTab": "Career",
    "projectsTab": "Projects",
    "skillsTab": "Skills",
    "resumeTab": "My Resume",

    "profileTitle": "Computer engineering student",

    "about-citation": "Passionate developer, I combine analysis and technical skills to create innovative solutions.",
    "about-presentation-1": "I am Emile Boulanger, a computer science student at CESI Engineering school in Bordeaux (currently in BAC+3).",
    "about-presentation-2": "Passionate about the world of software and web development, both on the backend and frontend, I am particularly drawn to the creative and analytical aspects that this field brings.",
    "about-presentation-3": "My aspiration is to contribute to dynamic and stimulating projects that foster innovation.",
    "about-presentation-4": "I plan to evolve in the technical aspects of development before eventually moving towards responsibilities related to project management.",
    "about-presentation-5": "You will have a deeper insight into my personality and my journey through this page.",

    "career-label-now" : "Now",
    "career-cesi" : "CESI Engineering school Bordeaux",
    "career-cesi-diplome" : "Computer Engineering Diploma",

    "career-cesi-text": "CESI is based on the Problem Based Learning (PBL) method, which places group projects in complete autonomy at the center of learning. I am currently in my 3rd year of specialization in computer science.",   
    "career-bac": "Val-de-Garonne High School, Marmande",
    "career-bac-diplome": "Scientific Baccalaureate Diploma",
    "career-bac-text": "Diploma obtained with the Highest Honors. My specialties were: Mathematics, Computer Science, and Engineering Science.",
    "career-academic-career": "Academic Career",
    "career-professional-career": "Professional Experience",

    "career-watsoft": "01/2024 - 04/2024 | Watsoft Distribution, Pessac",
    "career-watsoft-exp": "Fullstack Developer Internship: .NET / C# / Vue.js",
    "career-watsoft-text1": "As a fullstack developer intern at Watsoft, I was involved in all aspects of software development. Working within a small team, I participated in maintenance tasks (TMA) in an Agile environment. My main mission (3 months) involved the complete overhaul of a critical ERP feature. Thus, independently, I designed the new solution through all these steps:",
    "career-watsoft-text2": "1 - Requirement analysis",
    "career-watsoft-text3": "2 - Planning",
    "career-watsoft-text4": "3 - Creation of the new solution's design (Figma mockups)",
    "career-watsoft-text5": "4 - UML modeling (class/sequence diagrams)",
    "career-watsoft-text6": "5 - Frontend Development (Vue.js with Quasar framework)",
    "career-watsoft-text7": "6 - Backend Development (.NET C#, using hexagonal architecture)",
    "career-cgi": "04/2023 - 07/2023 | CGI, Le Haillan",
    "career-cgi-exp": "Digital Designer Internship",
    "career-cgi-text": "As part of a development team following the Agile Scrum methodology, I contributed to the creation of two internal mobile applications using React Native. I participated in designing the application mockups (UI design), brainstorming on business logic, and frontend development under the guidance of a Tech Lead.",
    "career-rauzan": "08/2022 | Caves de Rauzan, Rauzan",
    "career-rauzan-exp": "Cellar Employee",
    "career-rauzan-text": "I performed cleaning and maintenance tasks, various other cellar work, and participated in the Crémant harvest.",
    "career-girondehabitat": "01/2018 | Gironde Habitat, Bordeaux",
    "career-girondehabitat-exp": "Observation Internship in the Legal Department",
    "career-girondehabitat-text": "3rd-year observation internship. Introduction to the professional and legal environment.",

    "project-type-personnal" : "Personnal project",
    "project-type-academic" : "Academic project",
    "project-type-associative" : "Associative project",
    "project-button-learnmore" : "Learn More",    
    "project-description-cozyhomes": "Frontend part of a housing rental website in React.js.",
    "project-description-easysave": ".NET C# backup software with a WPF interface.",
    "project-description-portfolio": "This website! Developed in React.js.",
    "project-description-dbmanager" : "SQL Server database management software.",
    "project-description-internship-website" : "Internship search website designed for CESI students.",
    "project-description-adminsi" : "Redesign of the Abstergo company information system",
    "project-description-conceptionbdd" : "Designing the MySQL database for a travel agency.",
    "project-description-cesinova" : "Creation of a mini-rocket for the ArianeGroup competition.",
    "project-description-funkytown" : "Designing the network architecture of a fictional company.",
    "project-description-www" : "Creation of a miniature weather station on an Arduino board.",
    "project-description-github" : "My GitHub repository contains other small projects.",
    "project-title-cozyhomes" : "CozyHomes",
    "project-title-easysave" : "EasySave",
    "project-title-portfolio" : "Portfolio Website",
    "project-title-dbmanager" : ".NET Database Manager",
    "project-title-internship-website" : "CESI-STAGES.FR",
    "project-title-adminsi" : "IT administration",
    "project-title-conceptionbdd" : "Database Design",
    "project-title-cesinova" : "CESINOVA V1 rocketship",
    "project-title-funkytown" : "Funkytown Project",
    "project-title-www" : "Worldwide Weather Watcher Project",
    "project-title-github" : "Other GitHub Projects",
    "project-detail-cozyhomes1": "CozyHomes is a starting point for a lodging rental website, hotel, house, or other accommodation type.",
    "project-detail-cozyhomes2": "I only worked on the frontend part, which I developed using the React framework.",
    "project-description-easysave1": "EasySave is a backup software developed in C# .NET, featuring a WPF graphical interface and MVVM architecture.",
    "project-description-easysave2": "The software allows launching full or differential backups in parallel or sequentially.",
    "project-description-portfolio1": "The website you are currently browsing!",
    "project-description-portfolio2": "Developed in React, using the MaterialUI UI component library.",
    "project-description-dbmanager1": "This software allows managing the database of a sales company. Various actions such as creation, modification, or deletion can be performed.",
    "project-description-dbmanager2": "It is developed in C++ .NET with a WinForms graphical interface and an MVC architecture.",
    "project-description-internship-website1": "This website is a platform designed to assist students in their internship search by gathering job offers and enabling direct applications from cesi-stages.",
    "project-description-internship-website2": "It is developed in HTML/CSS/JS/PHP using the Laravel framework.",
    "project-description-adminsi1": "This project involves the redesign of the information system of the fictional company Abstergo, from firewall configuration to Active Directory setup, including the design of backup or authentication policies.",
    "project-description-adminsi2": "We designed a LAN - DMZ - WAN architecture and simulated this internal network using VirtualBox virtual machines.",
    "project-description-conceptionbdd1": "This small project, serving as an introduction to databases, involved designing the database for a travel agency.",
    "project-description-conceptionbdd2": "We developed the Entity-Relationship Diagram (ERD) and other schemas for the relational database, then implemented it on MySQL.",
    "project-description-funkytown1": "Funkytown is a fictional city for which we were tasked through this project. Our team designed the network architecture for the buildings outlined in red.",
    "project-description-funkytown2": "To simulate all the networks in the city, we created a PacketTracer model in which we configured each equipment using various protocols and our IP addressing plan."
}